Revit 2027 API
MultiplanarOption Enumeration
 Input argument type for Rebar.GetCenterlineCurves method. Controls whether all curves of a multi-planar Rebar element are returned by GetCenterlineCurves, or only the curves in the primary plane.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MultiplanarOption
Public Enumeration MultiplanarOption
public enum class MultiplanarOption
type MultiplanarOption
Members
Member name | Value | Description
IncludeAllMultiplanarCurves | 0 |  Include all curves.
IncludeOnlyPlanarCurves | 1 |  Include only curves which lie in the Rebar's primary plane.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace